; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v7 - type_1 ?v5 - type_2)
 	      (pred_1 ?v3 - object ?v5 - type_2)
	      (pred_2 ?v7 - type_1 ?v8 - type_3)
	      (pred_4 ?v7 - type_1 ?v3 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v7 - type_1 ?v6 ?v2 - type_2)
       :precondition (and  (pred_3 ?v7 ?v6))
       :effect (and  (pred_3 ?v7 ?v2)
		     (not (pred_3 ?v7 ?v6))))

   (:action op_2
       :parameters (?v7 - type_1 ?v1 - object ?v4 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v4) (pred_3 ?v7 ?v4) (pred_2 ?v7 ?v8))
       :effect (and (pred_4 ?v7 ?v1 ?v8)
		    (not (pred_1 ?v1 ?v4)) 
		    (not (pred_2 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_1 ?v1 - object ?v4 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v1 ?v8) (pred_3 ?v7 ?v4))
       :effect (and (pred_1 ?v1 ?v4)
		    (pred_2 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v1 ?v8)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_01 obj_05 - type_1
obj_04 obj_08 obj_07 obj_03 - type_3
obj_09 obj_11 obj_10 - type_2
obj_06 obj_02 - object)
(:init
(pred_3 obj_01 obj_11)
(pred_2 obj_01 obj_04)
(pred_2 obj_01 obj_08)
(pred_3 obj_05 obj_11)
(pred_2 obj_05 obj_07)
(pred_2 obj_05 obj_03)
(pred_1 obj_06 obj_10)
(pred_1 obj_02 obj_11)
)
(:goal
(and
(pred_1 obj_06 obj_09)
(pred_1 obj_02 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_01 obj_10)))
)
)

; plan
1. (op_2 obj_01 obj_02 obj_11 obj_08)
   deleted: (pred_1 obj_02 obj_11) (pred_2 obj_01 obj_08)
   added: (pred_4 obj_01 obj_02 obj_08)
   goals met: 0 of 2
2. (op_1 obj_05 obj_11 obj_10)
   deleted: (pred_3 obj_05 obj_11)
   added: (pred_3 obj_05 obj_10)
   goals met: 0 of 2
3. (op_2 obj_05 obj_06 obj_10 obj_03)
   deleted: (pred_1 obj_06 obj_10) (pred_2 obj_05 obj_03)
   added: (pred_4 obj_05 obj_06 obj_03)
   goals met: 0 of 2
4. (op_1 obj_01 obj_11 obj_09)
   deleted: (pred_3 obj_01 obj_11)
   added: (pred_3 obj_01 obj_09)
   goals met: 0 of 2
5. (op_1 obj_05 obj_10 obj_09)
   deleted: (pred_3 obj_05 obj_10)
   added: (pred_3 obj_05 obj_09)
   goals met: 0 of 2
6. (op_3 obj_01 obj_02 obj_09 obj_08)
   deleted: (pred_4 obj_01 obj_02 obj_08)
   added: (pred_1 obj_02 obj_09) (pred_2 obj_01 obj_08)
   goals met: 0 of 2
7. (op_3 obj_05 obj_06 obj_09 obj_03)
   deleted: (pred_4 obj_05 obj_06 obj_03)
   added: (pred_1 obj_06 obj_09) (pred_2 obj_05 obj_03)
   goals met: 1 of 2
8. (op_2 obj_05 obj_02 obj_09 obj_03)
   deleted: (pred_1 obj_02 obj_09) (pred_2 obj_05 obj_03)
   added: (pred_4 obj_05 obj_02 obj_03)
   goals met: 1 of 2
9. (op_1 obj_05 obj_09 obj_10)
   deleted: (pred_3 obj_05 obj_09)
   added: (pred_3 obj_05 obj_10)
   goals met: 1 of 2
10. (op_3 obj_05 obj_02 obj_10 obj_03)
   deleted: (pred_4 obj_05 obj_02 obj_03)
   added: (pred_1 obj_02 obj_10) (pred_2 obj_05 obj_03)
   goals met: 2 of 2
